; ModuleID = 'main.c'
source_filename = "main.c"
target datalayout = "e-m:e-p:32:32-p10:8:8-p20:8:8-i64:64-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-unknown"

%struct.pool_obj_t = type { i16, i16, i8, i8 }
%struct.Item = type { i16, i8 }
%struct.point_s = type { i16, i16 }
%struct.pipe_s = type { i16, i16, i8, i8 }

@PALETTE = hidden local_unnamed_addr constant [3 x i8] c"\00\7F\FF", align 1, !dbg !0
@WAVE = hidden local_unnamed_addr constant [4 x i16] [i16 100, i16 200, i16 300, i16 400], align 2, !dbg !10
@LOOKUP = hidden local_unnamed_addr constant [2 x i32] [i32 100000, i32 200000], align 4, !dbg !16
@FONT_5x3 = hidden local_unnamed_addr constant [50 x i8] c"\07\05\05\05\07\02\06\02\02\07\07\01\07\04\07\07\01\07\01\07\05\05\07\01\01\07\04\07\01\07\07\04\07\05\07\07\01\01\01\01\07\05\07\05\07\07\05\07\01\07", align 16, !dbg !23
@shared_fb = hidden global [80 x i8] zeroinitializer, align 16, !dbg !36
@pool = hidden local_unnamed_addr global [4 x %struct.pool_obj_t] zeroinitializer, align 16, !dbg !62
@BIRD_SPRITE = hidden local_unnamed_addr constant [3 x i8] c"\07\07\07", align 1, !dbg !30
@g_byte = hidden local_unnamed_addr global i8 0, align 1, !dbg !41
@g_short = hidden local_unnamed_addr global i16 0, align 2, !dbg !48
@g_int = hidden local_unnamed_addr global i32 0, align 4, !dbg !53
@g_shorts = hidden local_unnamed_addr global [8 x i16] zeroinitializer, align 16, !dbg !43

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "PALETTE", scope: !2, file: !3, line: 83, type: !33, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Apple clang version 17.0.0 (clang-1700.6.3.2)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !9, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "main.c", directory: "/home/user/jcc/examples/correctness")
!4 = !{!5, !8}
!5 = !DIDerivedType(tag: DW_TAG_typedef, name: "byte", file: !6, line: 7, baseType: !7)
!6 = !DIFile(filename: "include/jcc.h", directory: "/home/user/jcc")
!7 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!8 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!9 = !{!0, !10, !16, !23, !30, !36, !41, !43, !48, !50, !53, !55, !62, !72, !79, !88, !90, !92}
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "WAVE", scope: !2, file: !3, line: 84, type: !12, isLocal: false, isDefinition: true)
!12 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 64, elements: !14)
!13 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!14 = !{!15}
!15 = !DISubrange(count: 4)
!16 = !DIGlobalVariableExpression(var: !17, expr: !DIExpression())
!17 = distinct !DIGlobalVariable(name: "LOOKUP", scope: !2, file: !3, line: 85, type: !18, isLocal: false, isDefinition: true)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 64, elements: !21)
!19 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!20 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!21 = !{!22}
!22 = !DISubrange(count: 2)
!23 = !DIGlobalVariableExpression(var: !24, expr: !DIExpression())
!24 = distinct !DIGlobalVariable(name: "FONT_5x3", scope: !2, file: !25, line: 8, type: !26, isLocal: false, isDefinition: true)
!25 = !DIFile(filename: "./test_font_lookup.h", directory: "/home/user/jcc/examples/correctness")
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 400, elements: !28)
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !5)
!28 = !{!29}
!29 = !DISubrange(count: 50)
!30 = !DIGlobalVariableExpression(var: !31, expr: !DIExpression())
!31 = distinct !DIGlobalVariable(name: "BIRD_SPRITE", scope: !2, file: !32, line: 14, type: !33, isLocal: false, isDefinition: true)
!32 = !DIFile(filename: "./test_rendering.h", directory: "/home/user/jcc/examples/correctness")
!33 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 24, elements: !34)
!34 = !{!35}
!35 = !DISubrange(count: 3)
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "shared_fb", scope: !2, file: !3, line: 64, type: !38, isLocal: false, isDefinition: true)
!38 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 640, elements: !39)
!39 = !{!40}
!40 = !DISubrange(count: 80)
!41 = !DIGlobalVariableExpression(var: !42, expr: !DIExpression())
!42 = distinct !DIGlobalVariable(name: "g_byte", scope: !2, file: !3, line: 67, type: !5, isLocal: false, isDefinition: true)
!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "g_shorts", scope: !2, file: !3, line: 69, type: !45, isLocal: false, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 128, elements: !46)
!46 = !{!47}
!47 = !DISubrange(count: 8)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "g_short", scope: !2, file: !3, line: 70, type: !8, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "g_ints", scope: !2, file: !3, line: 72, type: !52, isLocal: false, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 128, elements: !14)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "g_int", scope: !2, file: !3, line: 73, type: !20, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariableExpression(var: !56, expr: !DIExpression())
!56 = distinct !DIGlobalVariable(name: "items", scope: !2, file: !3, line: 80, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 128, elements: !14)
!58 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Item", file: !3, line: 75, size: 32, elements: !59)
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !58, file: !3, line: 76, baseType: !8, size: 16)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "flag", scope: !58, file: !3, line: 77, baseType: !5, size: 8, offset: 16)
!62 = !DIGlobalVariableExpression(var: !63, expr: !DIExpression())
!63 = distinct !DIGlobalVariable(name: "pool", scope: !2, file: !64, line: 15, type: !65, isLocal: false, isDefinition: true)
!64 = !DIFile(filename: "./test_object_pool.h", directory: "/home/user/jcc/examples/correctness")
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 192, elements: !14)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pool_obj_t", file: !64, line: 8, size: 48, elements: !67)
!67 = !{!68, !69, !70, !71}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !66, file: !64, line: 9, baseType: !8, size: 16)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !66, file: !64, line: 10, baseType: !8, size: 16, offset: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !66, file: !64, line: 11, baseType: !5, size: 8, offset: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !66, file: !64, line: 12, baseType: !5, size: 8, offset: 40)
!72 = !DIGlobalVariableExpression(var: !73, expr: !DIExpression())
!73 = distinct !DIGlobalVariable(name: "g_pts", scope: !2, file: !3, line: 1750, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 128, elements: !14)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "point_s", file: !3, line: 1747, size: 32, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !75, file: !3, line: 1747, baseType: !8, size: 16)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !75, file: !3, line: 1747, baseType: !8, size: 16, offset: 16)
!79 = !DIGlobalVariableExpression(var: !80, expr: !DIExpression())
!80 = distinct !DIGlobalVariable(name: "g_pipes", scope: !2, file: !3, line: 1751, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 144, elements: !34)
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pipe_s", file: !3, line: 1748, size: 48, elements: !83)
!83 = !{!84, !85, !86, !87}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !82, file: !3, line: 1748, baseType: !8, size: 16)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "gap_y", scope: !82, file: !3, line: 1748, baseType: !8, size: 16, offset: 16)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !82, file: !3, line: 1748, baseType: !5, size: 8, offset: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "scored", scope: !82, file: !3, line: 1748, baseType: !5, size: 8, offset: 40)
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "g_rng_seed", scope: !2, file: !3, line: 2630, type: !8, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariableExpression(var: !91, expr: !DIExpression())
!91 = distinct !DIGlobalVariable(name: "g_state", scope: !2, file: !3, line: 2712, type: !8, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariableExpression(var: !93, expr: !DIExpression())
!93 = distinct !DIGlobalVariable(name: "g_frame", scope: !2, file: !3, line: 2713, type: !8, isLocal: false, isDefinition: true)
!94 = !{i32 7, !"Dwarf Version", i32 4}
!95 = !{i32 2, !"Debug Info Version", i32 3}
!96 = !{i32 1, !"wchar_size", i32 4}
!97 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!98 = !{!"Apple clang version 17.0.0 (clang-1700.6.3.2)"}
!99 = distinct !DISubprogram(name: "sendResult", scope: !3, file: !3, line: 91, type: !100, scopeLine: 91, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !105)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !102, !104, !8}
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "APDU", file: !6, line: 11, baseType: !103)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 32)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32)
!105 = !{!106, !107, !108}
!106 = !DILocalVariable(name: "apdu", arg: 1, scope: !99, file: !3, line: 91, type: !102)
!107 = !DILocalVariable(name: "buffer", arg: 2, scope: !99, file: !3, line: 91, type: !104)
!108 = !DILocalVariable(name: "result", arg: 3, scope: !99, file: !3, line: 91, type: !8)
!109 = !DILocation(line: 0, scope: !99)
!110 = !DILocation(line: 92, column: 31, scope: !99)
!111 = !DILocation(line: 92, column: 17, scope: !99)
!112 = !DILocation(line: 92, column: 15, scope: !99)
!113 = !{!114, !114, i64 0}
!114 = !{!"omnipotent char", !115, i64 0}
!115 = !{!"Simple C/C++ TBAA"}
!116 = !DILocation(line: 93, column: 17, scope: !99)
!117 = !DILocation(line: 93, column: 5, scope: !99)
!118 = !DILocation(line: 93, column: 15, scope: !99)
!119 = !DILocation(line: 94, column: 5, scope: !99)
!120 = !DILocation(line: 95, column: 5, scope: !99)
!121 = !DILocation(line: 96, column: 5, scope: !99)
!122 = !DILocation(line: 97, column: 1, scope: !99)
!123 = !DISubprogram(name: "jc_APDU_setOutgoing", scope: !6, file: !6, line: 96, type: !124, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!124 = !DISubroutineType(types: !125)
!125 = !{!8, !102}
!126 = !DISubprogram(name: "jc_APDU_setOutgoingLength", scope: !6, file: !6, line: 97, type: !127, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!127 = !DISubroutineType(types: !128)
!128 = !{null, !102, !8}
!129 = !DISubprogram(name: "jc_APDU_sendBytes", scope: !6, file: !6, line: 98, type: !130, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!130 = !DISubroutineType(types: !131)
!131 = !{null, !102, !8, !8}
!132 = distinct !DISubprogram(name: "add_shorts", scope: !3, file: !3, line: 103, type: !133, scopeLine: 103, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !135)
!133 = !DISubroutineType(types: !134)
!134 = !{!8, !8, !8}
!135 = !{!136, !137}
!136 = !DILocalVariable(name: "a", arg: 1, scope: !132, file: !3, line: 103, type: !8)
!137 = !DILocalVariable(name: "b", arg: 2, scope: !132, file: !3, line: 103, type: !8)
!138 = !DILocation(line: 0, scope: !132)
!139 = !DILocation(line: 104, column: 14, scope: !132)
!140 = !DILocation(line: 104, column: 5, scope: !132)
!141 = distinct !DISubprogram(name: "test_font_lookup", scope: !25, file: !25, line: 21, type: !142, scopeLine: 21, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !144)
!142 = !DISubroutineType(types: !143)
