; ModuleID = 'lib.aea4d3df3642ec66-cgu.0'
source_filename = "lib.aea4d3df3642ec66-cgu.0"
target datalayout = "e-m:e-p:32:32-p10:8:8-p20:8:8-i64:64-i128:128-n32:64-S128-ni:1:10:20"
target triple = "wasm32-unknown-unknown"

%Pipe = type { i16, i16, i8, i8 }

@_ZN3lib10DIGIT_FONT17h568307813fef6c2aE = internal unnamed_addr constant [50 x i8] c"\07\05\05\05\07\02\06\02\02\07\07\01\07\04\07\07\01\07\01\07\05\05\07\01\01\07\04\07\01\07\07\04\07\05\07\07\01\01\01\01\07\05\07\05\07\07\05\07\01\07", align 1, !dbg !0
@_ZN3lib11FRAMEBUFFER17h74699d2c84f1a332E = internal global [80 x i8] zeroinitializer, align 1, !dbg !8
@_ZN3lib16GAME_INITIALIZED17hdc6bee963eb1f766E.0 = internal unnamed_addr global i1 false, align 1, !dbg !13
@_ZN3lib4BIRD17h571dc8b4c80d60d7E.0 = internal unnamed_addr global i16 0, align 2, !dbg !15
@_ZN3lib4BIRD17h571dc8b4c80d60d7E.1 = internal unnamed_addr global i16 0, align 2, !dbg !24
@_ZN3lib4GAME17hbf8763b2c745ccd8E.0 = internal unnamed_addr global i8 0, align 2, !dbg !25
@_ZN3lib4GAME17hbf8763b2c745ccd8E.1 = internal unnamed_addr global i16 0, align 2, !dbg !32
@_ZN3lib4GAME17hbf8763b2c745ccd8E.2 = internal unnamed_addr global i16 0, align 2, !dbg !33
@_ZN3lib5PIPES17h0b113f338cd5ae43E = internal unnamed_addr global [18 x i8] zeroinitializer, align 2, !dbg !34
@_ZN3lib6NUM_D017h603139fb0e00dad5E.0 = internal unnamed_addr global i16 0, align 2, !dbg !45
@_ZN3lib6NUM_D117hc6caecc785c50e8dE.0 = internal unnamed_addr global i16 0, align 2, !dbg !47

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "DIGIT_FONT", linkageName: "_ZN3lib10DIGIT_FONT17h568307813fef6c2aE", scope: !2, file: !3, line: 112, type: !4, isLocal: true, isDefinition: true, align: 8)
!2 = !DINamespace(name: "lib", scope: null)
!3 = !DIFile(filename: "src/lib.rs", directory: "/home/user/jcc/examples/rusty", checksumkind: CSK_MD5, checksum: "97a2aa2f02ad7713f15c58b923dba752")
!4 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 400, align: 8, elements: !6)
!5 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!6 = !{!7}
!7 = !DISubrange(count: 50, lowerBound: 0)
!8 = !DIGlobalVariableExpression(var: !9, expr: !DIExpression())
!9 = distinct !DIGlobalVariable(name: "FRAMEBUFFER", linkageName: "_ZN3lib11FRAMEBUFFER17h74699d2c84f1a332E", scope: !2, file: !3, line: 100, type: !10, isLocal: true, isDefinition: true, align: 8)
!10 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 640, align: 8, elements: !11)
!11 = !{!12}
!12 = !DISubrange(count: 80, lowerBound: 0)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression(DW_OP_deref_size, 1, DW_OP_constu, 1, DW_OP_mul, DW_OP_constu, 0, DW_OP_plus, DW_OP_stack_value))
!14 = distinct !DIGlobalVariable(name: "GAME_INITIALIZED", linkageName: "_ZN3lib16GAME_INITIALIZED17hdc6bee963eb1f766E", scope: !2, file: !3, line: 109, type: !5, isLocal: true, isDefinition: true, align: 8)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 16))
!16 = distinct !DIGlobalVariable(name: "BIRD", linkageName: "_ZN3lib4BIRD17h571dc8b4c80d60d7E", scope: !2, file: !3, line: 101, type: !17, isLocal: true, isDefinition: true, align: 16)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "Bird", scope: !2, file: !18, size: 32, align: 16, flags: DIFlagPrivate, elements: !19, templateParams: !23, identifier: "4d267c232a4299c9512818aa1ecfdaa8")
!18 = !DIFile(filename: "<unknown>", directory: "")
!19 = !{!20, !22}
!20 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !18, baseType: !21, size: 16, align: 16, flags: DIFlagPrivate)
!21 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "velocity", scope: !17, file: !18, baseType: !21, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression(DW_OP_LLVM_fragment, 16, 16))
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression(DW_OP_LLVM_fragment, 0, 8))
!26 = distinct !DIGlobalVariable(name: "GAME", linkageName: "_ZN3lib4GAME17hbf8763b2c745ccd8E", scope: !2, file: !3, line: 107, type: !27, isLocal: true, isDefinition: true, align: 16)
!27 = !DICompositeType(tag: DW_TAG_structure_type, name: "GameState", scope: !2, file: !18, size: 48, align: 16, flags: DIFlagPrivate, elements: !28, templateParams: !23, identifier: "21a0107c8c04da0614a4af45594ab4c8")
!28 = !{!29, !30, !31}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !27, file: !18, baseType: !5, size: 8, align: 8, flags: DIFlagPrivate)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "score", scope: !27, file: !18, baseType: !21, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "frame_count", scope: !27, file: !18, baseType: !21, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!32 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression(DW_OP_LLVM_fragment, 16, 16))
!33 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression(DW_OP_LLVM_fragment, 32, 16))
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "PIPES", linkageName: "_ZN3lib5PIPES17h0b113f338cd5ae43E", scope: !2, file: !3, line: 102, type: !36, isLocal: true, isDefinition: true, align: 16)
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !37, size: 144, align: 16, elements: !43)
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "Pipe", scope: !2, file: !18, size: 48, align: 16, flags: DIFlagPrivate, elements: !38, templateParams: !23, identifier: "c66b226787126367a1df6a88f6cca50e")
!38 = !{!39, !40, !41, !42}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !18, baseType: !21, size: 16, align: 16, flags: DIFlagPrivate)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "gap_y", scope: !37, file: !18, baseType: !21, size: 16, align: 16, offset: 16, flags: DIFlagPrivate)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "active", scope: !37, file: !18, baseType: !5, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "scored", scope: !37, file: !18, baseType: !5, size: 8, align: 8, offset: 40, flags: DIFlagPrivate)
!43 = !{!44}
!44 = !DISubrange(count: 3, lowerBound: 0)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "NUM_D0", linkageName: "_ZN3lib6NUM_D017h603139fb0e00dad5E", scope: !2, file: !3, line: 126, type: !21, isLocal: true, isDefinition: true, align: 16)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "NUM_D1", linkageName: "_ZN3lib6NUM_D117hc6caecc785c50e8dE", scope: !2, file: !3, line: 127, type: !21, isLocal: true, isDefinition: true, align: 16)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "NUM_D2", linkageName: "_ZN3lib6NUM_D217hce061614100c2eebE", scope: !2, file: !3, line: 128, type: !21, isLocal: true, isDefinition: true, align: 16)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "RNG_STATE", linkageName: "_ZN3lib9RNG_STATE17h0f6aa4bd50ad1b09E", scope: !2, file: !3, line: 108, type: !21, isLocal: true, isDefinition: true, align: 16)
!53 = !{!"rustc version 1.91.1 (ed61e7d7e 2025-11-07)"}
!54 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !55, producer: "clang LLVM (rustc version 1.91.1 (ed61e7d7e 2025-11-07))", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !56, globals: !64, splitDebugInlining: false, nameTableKind: None)
!55 = !DIFile(filename: "src/lib.rs/@/lib.aea4d3df3642ec66-cgu.0", directory: "/home/user/jcc/examples/rusty")
!56 = !{!57}
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !58, file: !18, baseType: !60, size: 8, align: 8, flags: DIFlagEnumClass, elements: !61)
!58 = !DINamespace(name: "ffi", scope: !59)
!59 = !DINamespace(name: "core", scope: null)
!60 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!61 = !{!62, !63}
!62 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!64 = !{!0, !8, !65, !66, !67, !34, !45, !47, !49, !51}
!65 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!66 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!67 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!68 = !{i32 7, !"Dwarf Version", i32 4}
!69 = !{i32 2, !"Debug Info Version", i32 3}
!70 = distinct !DISubprogram(name: "panic", linkageName: "_RNvCskdKJRKLKjqM_7___rustc17rust_begin_unwind", scope: !2, file: !3, line: 11, type: !71, scopeLine: 11, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !241)
!71 = !DISubroutineType(types: !72)
!72 = !{null, !73}
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::panic_info::PanicInfo", baseType: !74, size: 32, align: 32, dwarfAddressSpace: 0)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "PanicInfo", scope: !75, file: !18, size: 96, align: 32, flags: DIFlagPublic, elements: !77, templateParams: !23, identifier: "a7ff27c311cec15ceec6eeaaf30073e")
!75 = !DINamespace(name: "panic_info", scope: !76)
!76 = !DINamespace(name: "panic", scope: !59)
!77 = !{!78, !217, !238, !240}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !74, file: !18, baseType: !79, size: 32, align: 32, flags: DIFlagPrivate)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Arguments", baseType: !80, size: 32, align: 32, dwarfAddressSpace: 0)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !81, file: !18, size: 192, align: 32, flags: DIFlagPublic, elements: !82, templateParams: !23, identifier: "b43f68f3d6a0fbeec53e7b4ab54eab3e")
!81 = !DINamespace(name: "fmt", scope: !59)
!82 = !{!83, !95, !139}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !80, file: !18, baseType: !84, size: 64, align: 32, flags: DIFlagPrivate)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !18, size: 64, align: 32, elements: !85, templateParams: !23, identifier: "4e66b00a376d6af5b8765440fb2839f")
!85 = !{!86, !94}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !84, file: !18, baseType: !87, size: 32, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 32, align: 32, dwarfAddressSpace: 0)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !18, size: 64, align: 32, elements: !89, templateParams: !23, identifier: "9277eecd40495f85161460476aacc992")
!89 = !{!90, !92}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !88, file: !18, baseType: !91, size: 32, align: 32)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 32, align: 32, dwarfAddressSpace: 0)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !88, file: !18, baseType: !93, size: 32, align: 32, offset: 32)
!93 = !DIBasicType(name: "usize", size: 32, encoding: DW_ATE_unsigned)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !84, file: !18, baseType: !93, size: 32, align: 32, offset: 32)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !80, file: !18, baseType: !96, size: 64, align: 32, offset: 128, flags: DIFlagPrivate)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !97, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !98, templateParams: !23, identifier: "91cea1cb081a6bd35ffc0ad84c7da3fa")
!97 = !DINamespace(name: "option", scope: !59)
!98 = !{!99}
!99 = !DICompositeType(tag: DW_TAG_variant_part, scope: !96, file: !18, size: 64, align: 32, elements: !100, templateParams: !23, identifier: "25cb8c087eed993241ce3e8a29dcad0c", discriminator: !138)
!100 = !{!101, !134}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !99, file: !18, baseType: !102, size: 64, align: 32, extraData: i32 0)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !96, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !23, templateParams: !103, identifier: "59aedc9e429d88f25401f6fa44bedea0")
!103 = !{!104}
!104 = !DITemplateTypeParameter(name: "T", type: !105)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !18, size: 64, align: 32, elements: !106, templateParams: !23, identifier: "b793286bbd338247c0a1d931db267129")
!106 = !{!107, !133}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !105, file: !18, baseType: !108, size: 32, align: 32)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 32, align: 32, dwarfAddressSpace: 0)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !110, file: !18, size: 192, align: 32, flags: DIFlagPublic, elements: !111, templateParams: !23, identifier: "a4ab11d2ee165f8b88862ee3b9974263")
!110 = !DINamespace(name: "rt", scope: !81)
!111 = !{!112, !113, !115, !132}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !109, file: !18, baseType: !93, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !109, file: !18, baseType: !114, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!114 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !109, file: !18, baseType: !116, size: 64, align: 32, flags: DIFlagPublic)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !110, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !117, templateParams: !23, identifier: "1553706adb59700b130002cd212bb18a")
!117 = !{!118}
!118 = !DICompositeType(tag: DW_TAG_variant_part, scope: !116, file: !18, size: 64, align: 32, elements: !119, templateParams: !23, identifier: "e271c4a5eb96dfb1f33b87c04530c59b", discriminator: !131)
!119 = !{!120, !125, !129}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !118, file: !18, baseType: !121, size: 64, align: 32, extraData: i16 0)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !116, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !122, templateParams: !23, identifier: "867c86a849d0187f79ccd18abd9f618b")
!122 = !{!123}
!123 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !121, file: !18, baseType: !124, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!124 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !118, file: !18, baseType: !126, size: 64, align: 32, extraData: i16 1)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !116, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !127, templateParams: !23, identifier: "d95fdc54b6c675a077064cc8ea25da51")
!127 = !{!128}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !126, file: !18, baseType: !93, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !118, file: !18, baseType: !130, size: 64, align: 32, extraData: i16 2)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !116, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !23, identifier: "afb7b4ce4a245ceff3fc0e027c3ef154")
!131 = !DIDerivedType(tag: DW_TAG_member, scope: !116, file: !18, baseType: !124, size: 16, align: 16, flags: DIFlagArtificial)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !109, file: !18, baseType: !116, size: 64, align: 32, offset: 64, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !105, file: !18, baseType: !93, size: 32, align: 32, offset: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !99, file: !18, baseType: !135, size: 64, align: 32)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !96, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !136, templateParams: !103, identifier: "59ba6634ed1e651771f6e92d6a1e53f3")
!136 = !{!137}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !135, file: !18, baseType: !105, size: 64, align: 32, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, scope: !96, file: !18, baseType: !114, size: 32, align: 32, flags: DIFlagArtificial)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !80, file: !18, baseType: !140, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !18, size: 64, align: 32, elements: !141, templateParams: !23, identifier: "3197e7226de03c76ed82787246f4cdf5")
!141 = !{!142, !216}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !140, file: !18, baseType: !143, size: 32, align: 32)
!143 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !144, size: 32, align: 32, dwarfAddressSpace: 0)
!144 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !110, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !145, templateParams: !23, identifier: "69447bf69f4c3810ed91632cf66cf04f")
!145 = !{!146}
!146 = !DIDerivedType(tag: DW_TAG_member, name: "ty", scope: !144, file: !18, baseType: !147, size: 64, align: 32, flags: DIFlagPrivate)
!147 = !DICompositeType(tag: DW_TAG_structure_type, name: "ArgumentType", scope: !110, file: !18, size: 64, align: 32, flags: DIFlagPrivate, elements: !148, templateParams: !23, identifier: "1ac5fba2f994c544d6684607133e9be5")
!148 = !{!149}
!149 = !DICompositeType(tag: DW_TAG_variant_part, scope: !147, file: !18, size: 64, align: 32, elements: !150, templateParams: !23, identifier: "f48a230561e2ccc9413d2b0333582cad", discriminator: !215)
!150 = !{!151, !211}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "Placeholder", scope: !149, file: !18, baseType: !152, size: 64, align: 32)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !147, file: !18, size: 64, align: 32, flags: DIFlagPrivate, elements: !153, templateParams: !23, identifier: "a12230d4ea805859231be27929e2ea16")
!153 = !{!154, !164, !205}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !152, file: !18, baseType: !155, size: 32, align: 32, flags: DIFlagPrivate)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !156, file: !18, size: 32, align: 32, flags: DIFlagPublic, elements: !158, templateParams: !162, identifier: "d5d6b83a02cc9ee44bee6a531d8fd030")
!156 = !DINamespace(name: "non_null", scope: !157)
!157 = !DINamespace(name: "ptr", scope: !59)
!158 = !{!159}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !155, file: !18, baseType: !160, size: 32, align: 32, flags: DIFlagPrivate)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !161, size: 32, align: 32, dwarfAddressSpace: 0)
!161 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "T", type: !161)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !152, file: !18, baseType: !165, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "unsafe fn(core::ptr::non_null::NonNull<()>, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !166, size: 32, align: 32, dwarfAddressSpace: 0)
!166 = !DISubroutineType(types: !167)
!167 = !{!168, !155, !185}
!168 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !169, file: !18, size: 8, align: 8, flags: DIFlagPublic, elements: !170, templateParams: !23, identifier: "7519c61b67b9b2ba245c8d84b3ec0a5")
!169 = !DINamespace(name: "result", scope: !59)
!170 = !{!171}
!171 = !DICompositeType(tag: DW_TAG_variant_part, scope: !168, file: !18, size: 8, align: 8, elements: !172, templateParams: !23, identifier: "8e984bcaaceae27fc0c7863d29fa5ba9", discriminator: !184)
!172 = !{!173, !180}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !171, file: !18, baseType: !174, size: 8, align: 8, extraData: i8 0)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !168, file: !18, size: 8, align: 8, flags: DIFlagPublic, elements: !175, templateParams: !177, identifier: "cf7f1922b1a3ef4c1fc65f8e95e927e2")
!175 = !{!176}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !174, file: !18, baseType: !161, align: 8, offset: 8, flags: DIFlagPublic)
!177 = !{!163, !178}
!178 = !DITemplateTypeParameter(name: "E", type: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !81, file: !18, align: 8, flags: DIFlagPublic, elements: !23, identifier: "e1b5868c30e0732b4cd40bb11404154a")
!180 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !171, file: !18, baseType: !181, size: 8, align: 8, extraData: i8 1)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !168, file: !18, size: 8, align: 8, flags: DIFlagPublic, elements: !182, templateParams: !177, identifier: "be64f4dd65841bc64d2b624e00508c8")
!182 = !{!183}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !181, file: !18, baseType: !179, align: 8, offset: 8, flags: DIFlagPublic)
!184 = !DIDerivedType(tag: DW_TAG_member, scope: !168, file: !18, baseType: !60, size: 8, align: 8, flags: DIFlagArtificial)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !186, size: 32, align: 32, dwarfAddressSpace: 0)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !81, file: !18, size: 128, align: 32, flags: DIFlagPublic, elements: !187, templateParams: !23, identifier: "678d10f925fbeb24dc345403b140a3fb")
!187 = !{!188, !194}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !186, file: !18, baseType: !189, size: 64, align: 32, offset: 64, flags: DIFlagPrivate)
!189 = !DICompositeType(tag: DW_TAG_structure_type, name: "FormattingOptions", scope: !81, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !190, templateParams: !23, identifier: "b8357171a05d10b375efe9576f18142d")
!190 = !{!191, !192, !193}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !189, file: !18, baseType: !114, size: 32, align: 32, flags: DIFlagPrivate)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !189, file: !18, baseType: !124, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !189, file: !18, baseType: !124, size: 16, align: 16, offset: 48, flags: DIFlagPrivate)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !186, file: !18, baseType: !195, size: 64, align: 32, flags: DIFlagPrivate)
!195 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !18, size: 64, align: 32, elements: !196, templateParams: !23, identifier: "e676b90f86a1b75be2e2d0f7d5ffd4e")
!196 = !{!197, !200}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !195, file: !18, baseType: !198, size: 32, align: 32)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 32, align: 32, dwarfAddressSpace: 0)
!199 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !18, align: 8, elements: !23, identifier: "99c8eb6ca70d5f42d6b20755d8b42af6")
!200 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !195, file: !18, baseType: !201, size: 32, align: 32, offset: 32)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !202, size: 32, align: 32, dwarfAddressSpace: 0)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !93, size: 192, align: 32, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 6, lowerBound: 0)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_lifetime", scope: !152, file: !18, baseType: !206, align: 8, offset: 64, flags: DIFlagPrivate)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&()>", scope: !207, file: !18, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !208, identifier: "7bc474ee408d5350975fca11ed5e512b")
!207 = !DINamespace(name: "marker", scope: !59)
!208 = !{!209}
!209 = !DITemplateTypeParameter(name: "T", type: !210)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&()", baseType: !161, size: 32, align: 32, dwarfAddressSpace: 0)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "Count", scope: !149, file: !18, baseType: !212, size: 64, align: 32, extraData: i32 0)
!212 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !147, file: !18, size: 64, align: 32, flags: DIFlagPrivate, elements: !213, templateParams: !23, identifier: "7d86f628fe399e923a7ce3d3ebcccc54")
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !212, file: !18, baseType: !124, size: 16, align: 16, offset: 32, flags: DIFlagPrivate)
!215 = !DIDerivedType(tag: DW_TAG_member, scope: !147, file: !18, baseType: !114, size: 32, align: 32, flags: DIFlagArtificial)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !140, file: !18, baseType: !93, size: 32, align: 32, offset: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "location", scope: !74, file: !18, baseType: !218, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !219, size: 32, align: 32, dwarfAddressSpace: 0)
!219 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !220, file: !18, size: 128, align: 32, flags: DIFlagPublic, elements: !221, templateParams: !23, identifier: "99be5f1473c641f16871c31c71f62ecf")
!220 = !DINamespace(name: "location", scope: !76)
!221 = !{!222, !232, !233, !234}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "filename", scope: !219, file: !18, baseType: !223, size: 64, align: 32, flags: DIFlagPrivate)
!223 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<str>", scope: !156, file: !18, size: 64, align: 32, flags: DIFlagPublic, elements: !224, templateParams: !230, identifier: "48e5e0aee0f2f8c6996d674e9386f432")
!224 = !{!225}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !223, file: !18, baseType: !226, size: 64, align: 32, flags: DIFlagPrivate)
!226 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const str", file: !18, size: 64, align: 32, elements: !227, templateParams: !23, identifier: "238a44609877474087c05adf26cd41fa")
!227 = !{!228, !229}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !226, file: !18, baseType: !91, size: 32, align: 32)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !226, file: !18, baseType: !93, size: 32, align: 32, offset: 32)
!230 = !{!231}
!231 = !DITemplateTypeParameter(name: "T", type: !60)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !219, file: !18, baseType: !114, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !219, file: !18, baseType: !114, size: 32, align: 32, offset: 96, flags: DIFlagPrivate)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_filename", scope: !219, file: !18, baseType: !235, align: 8, offset: 128, flags: DIFlagPrivate)
!235 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&str>", scope: !207, file: !18, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !236, identifier: "41bedb8054ca60e029ceabcec56f9978")
!236 = !{!237}
!237 = !DITemplateTypeParameter(name: "T", type: !88)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "can_unwind", scope: !74, file: !18, baseType: !239, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!239 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "force_no_backtrace", scope: !74, file: !18, baseType: !239, size: 8, align: 8, offset: 72, flags: DIFlagPrivate)
!241 = !{!242}
!242 = !DILocalVariable(name: "_info", arg: 1, scope: !70, file: !3, line: 11, type: !73)
!243 = !DILocation(line: 0, scope: !70)
!244 = !DILocation(line: 12, column: 5, scope: !70)
!245 = distinct !DISubprogram(name: "drawNumber", linkageName: "_ZN3lib10drawNumber17h9e0b83d1ba77bfc9E", scope: !2, file: !3, line: 481, type: !246, scopeLine: 481, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !248)
!246 = !DISubroutineType(cc: DW_CC_nocall, types: !247)
!247 = !{null, !21, !21, !21, !5}
!248 = !{!249, !250, !251, !252, !253, !255, !257, !259, !261}
!249 = !DILocalVariable(name: "center_x", arg: 1, scope: !245, file: !3, line: 481, type: !21)
!250 = !DILocalVariable(name: "y", arg: 2, scope: !245, file: !3, line: 481, type: !21)
!251 = !DILocalVariable(name: "number", arg: 3, scope: !245, file: !3, line: 481, type: !21)
!252 = !DILocalVariable(name: "color", arg: 4, scope: !245, file: !3, line: 481, type: !5)
!253 = !DILocalVariable(name: "number", scope: !254, file: !3, line: 482, type: !21, align: 16)
!254 = distinct !DILexicalBlock(scope: !245, file: !3, line: 482, column: 5)
!255 = !DILocalVariable(name: "num_digits", scope: !256, file: !3, line: 492, type: !21, align: 16)
!256 = distinct !DILexicalBlock(scope: !254, file: !3, line: 492, column: 5)
!257 = !DILocalVariable(name: "temp", scope: !258, file: !3, line: 493, type: !21, align: 16)
!258 = distinct !DILexicalBlock(scope: !256, file: !3, line: 493, column: 5)
!259 = !DILocalVariable(name: "width", scope: !260, file: !3, line: 517, type: !21, align: 16)
!260 = distinct !DILexicalBlock(scope: !258, file: !3, line: 517, column: 9)
!261 = !DILocalVariable(name: "start_x", scope: !262, file: !3, line: 518, type: !21, align: 16)
!262 = distinct !DILexicalBlock(scope: !260, file: !3, line: 518, column: 9)
!263 = !DILocation(line: 0, scope: !245)
!264 = !DILocation(line: 0, scope: !254)
!265 = !DILocation(line: 484, column: 8, scope: !254)
!266 = !DILocation(line: 483, column: 8, scope: !254)
!267 = !DILocation(line: 487, column: 9, scope: !254)
!268 = !DILocation(line: 488, column: 9, scope: !254)
!269 = !DILocation(line: 489, column: 9, scope: !254)
!270 = !DILocation(line: 0, scope: !258)
!271 = !DILocation(line: 496, column: 12, scope: !258)
!272 = !DILocation(line: 497, column: 13, scope: !258)
!273 = !DILocation(line: 0, scope: !256)
!274 = !DILocation(line: 496, column: 9, scope: !258)
!275 = !DILocation(line: 493, column: 20, scope: !256)
!276 = !DILocation(line: 501, column: 16, scope: !258)
!277 = !DILocation(line: 517, column: 21, scope: !258)
!278 = !DILocation(line: 0, scope: !260)
!279 = !DILocation(line: 518, column: 38, scope: !260)
!280 = !DILocation(line: 518, column: 27, scope: !260)
!281 = !DILocation(line: 0, scope: !262)
!282 = !DILocation(line: 520, column: 12, scope: !262)
!283 = !DILocation(line: 503, column: 17, scope: !258)
!284 = !DILocation(line: 502, column: 17, scope: !258)
!285 = !DILocation(line: 501, column: 13, scope: !258)
!286 = !DILocation(line: 506, column: 16, scope: !258)
!287 = !DILocation(line: 508, column: 17, scope: !258)
!288 = !DILocation(line: 507, column: 17, scope: !258)
!289 = !DILocation(line: 506, column: 13, scope: !258)
!290 = !DILocation(line: 511, column: 16, scope: !258)
!291 = !DILocation(line: 512, column: 17, scope: !258)
!292 = !DILocation(line: 511, column: 13, scope: !258)
!293 = !DILocation(line: 521, column: 35, scope: !262)
!294 = !DILocation(line: 521, column: 13, scope: !262)
!295 = !DILocation(line: 522, column: 13, scope: !262)
!296 = !DILocation(line: 520, column: 9, scope: !262)
!297 = !DILocation(line: 524, column: 12, scope: !262)
!298 = !DILocation(line: 525, column: 35, scope: !262)
!299 = !DILocation(line: 525, column: 13, scope: !262)
!300 = !DILocation(line: 526, column: 13, scope: !262)
!301 = !DILocation(line: 524, column: 9, scope: !262)
!302 = !DILocation(line: 528, column: 31, scope: !262)
!303 = !DILocation(line: 528, column: 9, scope: !262)
!304 = !DILocation(line: 530, column: 2, scope: !245)
!305 = distinct !DISubprogram(name: "reset_game", linkageName: "_ZN3lib10reset_game17hd18b9fe9bf0032f6E", scope: !2, file: !3, line: 256, type: !306, scopeLine: 256, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !308)
!306 = !DISubroutineType(types: !307)
!307 = !{null}
!308 = !{!309}
!309 = !DILocalVariable(name: "i", scope: !310, file: !3, line: 261, type: !93, align: 32)
!310 = distinct !DILexicalBlock(scope: !305, file: !3, line: 261, column: 9)
!311 = !DILocation(line: 258, column: 9, scope: !305)
!312 = !DILocation(line: 259, column: 9, scope: !305)
!313 = !DILocation(line: 0, scope: !310)
!314 = !DILocation(line: 263, column: 13, scope: !310)
!315 = !DILocation(line: 264, column: 13, scope: !310)
!316 = !DILocation(line: 268, column: 9, scope: !310)
!317 = !DILocation(line: 269, column: 9, scope: !310)
!318 = !DILocation(line: 270, column: 9, scope: !310)
!319 = !DILocation(line: 271, column: 9, scope: !310)
!320 = !DILocation(line: 273, column: 2, scope: !305)
!321 = distinct !DISubprogram(name: "spawn_pipe", linkageName: "_ZN3lib10spawn_pipe17h6d0176eb64ed2057E", scope: !2, file: !3, line: 291, type: !322, scopeLine: 291, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !324)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !21}
!324 = !{!325, !326}
!325 = !DILocalVariable(name: "x", arg: 1, scope: !321, file: !3, line: 291, type: !21)
!326 = !DILocalVariable(name: "i", scope: !327, file: !3, line: 293, type: !93, align: 32)
!327 = distinct !DILexicalBlock(scope: !321, file: !3, line: 293, column: 9)
!328 = !DILocation(line: 0, scope: !321)
!329 = !DILocation(line: 0, scope: !327)
!330 = !DILocation(line: 295, column: 16, scope: !327)
!331 = !DILocation(line: 305, column: 2, scope: !321)
!332 = !DILocation(line: 296, column: 17, scope: !327)
!333 = !DILocation(line: 297, column: 34, scope: !327)
!334 = !DILocation(line: 297, column: 17, scope: !327)
!335 = !DILocation(line: 298, column: 17, scope: !327)
!336 = !DILocation(line: 299, column: 17, scope: !327)
!337 = distinct !DISubprogram(name: "render_game", linkageName: "_ZN3lib11render_game17h39ae85af2824aafbE", scope: !2, file: !3, line: 606, type: !306, scopeLine: 606, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23)
!338 = !DILocation(line: 608, column: 12, scope: !337)
!339 = !DILocation(line: 609, column: 13, scope: !337)
!340 = !DILocation(line: 0, scope: !337)
!341 = !DILocation(line: 614, column: 13, scope: !337)
!342 = !DILocation(line: 615, column: 13, scope: !337)
!343 = !DILocation(line: 616, column: 13, scope: !337)
!344 = !DILocation(line: 621, column: 13, scope: !337)
!345 = !DILocation(line: 622, column: 13, scope: !337)
!346 = !DILocation(line: 623, column: 13, scope: !337)
!347 = !DILocation(line: 626, column: 2, scope: !337)
!348 = distinct !DISubprogram(name: "update_bird", linkageName: "_ZN3lib11update_bird17h3beb04e75e34aa8aE", scope: !2, file: !3, line: 340, type: !349, scopeLine: 340, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !351)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !5}
!351 = !{!352, !353}
!352 = !DILocalVariable(name: "flap", arg: 1, scope: !348, file: !3, line: 340, type: !5)
!353 = !DILocalVariable(name: "max_y", scope: !354, file: !3, line: 357, type: !21, align: 16)
!354 = distinct !DILexicalBlock(scope: !348, file: !3, line: 357, column: 9)
!355 = !DILocation(line: 0, scope: !348)
!356 = !DILocation(line: 0, scope: !354)
!357 = !DILocation(line: 342, column: 12, scope: !348)
!358 = !DILocation(line: 351, column: 9, scope: !348)
!359 = !DILocation(line: 353, column: 12, scope: !348)
!360 = !DILocation(line: 354, column: 13, scope: !348)
!361 = !DILocation(line: 355, column: 13, scope: !348)
!362 = !DILocation(line: 353, column: 9, scope: !348)
!363 = !DILocation(line: 358, column: 12, scope: !354)
!364 = !DILocation(line: 359, column: 13, scope: !354)
!365 = !DILocation(line: 358, column: 9, scope: !354)
!366 = !DILocation(line: 362, column: 2, scope: !348)
!367 = distinct !DISubprogram(name: "drawGameOver", linkageName: "_ZN3lib12drawGameOver17h668eec5f6df376c3E", scope: !2, file: !3, line: 592, type: !306, scopeLine: 592, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !368)
!368 = !{!369, !371}
!369 = !DILocalVariable(name: "cx", scope: !370, file: !3, line: 593, type: !21, align: 16)
!370 = distinct !DILexicalBlock(scope: !367, file: !3, line: 593, column: 5)
!371 = !DILocalVariable(name: "cy", scope: !372, file: !3, line: 594, type: !21, align: 16)
!372 = distinct !DILexicalBlock(scope: !370, file: !3, line: 594, column: 5)
!373 = !DILocation(line: 0, scope: !370)
!374 = !DILocation(line: 0, scope: !372)
!375 = !DILocation(line: 596, column: 5, scope: !372)
!376 = !DILocation(line: 597, column: 28, scope: !372)
!377 = !DILocation(line: 597, column: 5, scope: !372)
!378 = !DILocation(line: 600, column: 5, scope: !372)
!379 = !DILocation(line: 601, column: 5, scope: !372)
!380 = !DILocation(line: 602, column: 5, scope: !372)
!381 = !DILocation(line: 603, column: 2, scope: !367)
!382 = distinct !DISubprogram(name: "random_gap_y", linkageName: "_ZN3lib12random_gap_y17h6eff876945902f3aE", scope: !2, file: !3, line: 244, type: !383, scopeLine: 244, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !385)
!383 = !DISubroutineType(types: !384)
!384 = !{!21}
!385 = !{!386, !388, !390}
!386 = !DILocalVariable(name: "min_y", scope: !387, file: !3, line: 245, type: !21, align: 16)
!387 = distinct !DILexicalBlock(scope: !382, file: !3, line: 245, column: 5)
!388 = !DILocalVariable(name: "max_y", scope: !389, file: !3, line: 246, type: !21, align: 16)
!389 = distinct !DILexicalBlock(scope: !387, file: !3, line: 246, column: 5)
!390 = !DILocalVariable(name: "range", scope: !391, file: !3, line: 247, type: !21, align: 16)
!391 = distinct !DILexicalBlock(scope: !389, file: !3, line: 247, column: 5)
!392 = !DILocation(line: 0, scope: !387)
!393 = !DILocation(line: 0, scope: !389)
!394 = !DILocation(line: 0, scope: !391)
!395 = !DILocation(line: 248, column: 14, scope: !391)
!396 = !DILocation(line: 248, column: 13, scope: !391)
!397 = !DILocation(line: 248, column: 5, scope: !391)
!398 = !DILocation(line: 249, column: 2, scope: !382)
!399 = distinct !DISubprogram(name: "random_short", linkageName: "_ZN3lib12random_short17h8c52220c7d87c14aE", scope: !2, file: !3, line: 236, type: !383, scopeLine: 236, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23)
!400 = !DILocation(line: 238, column: 35, scope: !399)
!401 = !DILocation(line: 238, column: 23, scope: !399)
!402 = !DILocation(line: 238, column: 22, scope: !399)
!403 = !DILocation(line: 238, column: 21, scope: !399)
!404 = !DILocation(line: 238, column: 9, scope: !399)
!405 = !DILocation(line: 241, column: 2, scope: !399)
!406 = distinct !DISubprogram(name: "update_pipes", linkageName: "_ZN3lib12update_pipes17h766c122619250a74E", scope: !2, file: !3, line: 313, type: !306, scopeLine: 313, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !407)
!407 = !{!408, !410}
!408 = !DILocalVariable(name: "i", scope: !409, file: !3, line: 315, type: !93, align: 32)
!409 = distinct !DILexicalBlock(scope: !406, file: !3, line: 315, column: 9)
!410 = !DILocalVariable(name: "rightmost_x", scope: !411, file: !3, line: 332, type: !21, align: 16)
!411 = distinct !DILexicalBlock(scope: !409, file: !3, line: 332, column: 9)
!412 = !DILocation(line: 0, scope: !409)
!413 = !DILocation(line: 317, column: 16, scope: !409)
!414 = !DILocation(line: 337, column: 2, scope: !406)
!415 = !DILocation(line: 334, column: 13, scope: !411)
!416 = !DILocation(line: 318, column: 17, scope: !409)
!417 = !DILocation(line: 320, column: 20, scope: !409)
!418 = !DILocation(line: 321, column: 21, scope: !409)
!419 = !DILocation(line: 322, column: 21, scope: !409)
!420 = !DILocation(line: 320, column: 17, scope: !409)
!421 = !DILocation(line: 325, column: 20, scope: !409)
!422 = !DILocation(line: 326, column: 21, scope: !409)
!423 = !DILocation(line: 325, column: 17, scope: !409)
!424 = !DILocation(line: 332, column: 27, scope: !409)
!425 = !DILocation(line: 0, scope: !411)
!426 = !DILocation(line: 333, column: 12, scope: !411)
!427 = distinct !DISubprogram(name: "check_collision", linkageName: "_ZN3lib15check_collision17h4f705c960de6c75bE", scope: !2, file: !3, line: 365, type: !428, scopeLine: 365, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !430)
!428 = !DISubroutineType(types: !429)
!429 = !{!5}
!430 = !{!431, !433, !435, !437, !439, !441, !443, !445, !447, !449}
!431 = !DILocalVariable(name: "bird_screen_y", scope: !432, file: !3, line: 367, type: !21, align: 16)
!432 = distinct !DILexicalBlock(scope: !427, file: !3, line: 367, column: 9)
!433 = !DILocalVariable(name: "bird_top", scope: !434, file: !3, line: 368, type: !21, align: 16)
!434 = distinct !DILexicalBlock(scope: !432, file: !3, line: 368, column: 9)
!435 = !DILocalVariable(name: "bird_bottom", scope: !436, file: !3, line: 369, type: !21, align: 16)
!436 = distinct !DILexicalBlock(scope: !434, file: !3, line: 369, column: 9)
!437 = !DILocalVariable(name: "bird_left", scope: !438, file: !3, line: 370, type: !21, align: 16)
!438 = distinct !DILexicalBlock(scope: !436, file: !3, line: 370, column: 9)
!439 = !DILocalVariable(name: "bird_right", scope: !440, file: !3, line: 371, type: !21, align: 16)
!440 = distinct !DILexicalBlock(scope: !438, file: !3, line: 371, column: 9)
!441 = !DILocalVariable(name: "i", scope: !442, file: !3, line: 380, type: !93, align: 32)
!442 = distinct !DILexicalBlock(scope: !440, file: !3, line: 380, column: 9)
!443 = !DILocalVariable(name: "pipe_left", scope: !444, file: !3, line: 383, type: !21, align: 16)
!444 = distinct !DILexicalBlock(scope: !442, file: !3, line: 383, column: 17)
!445 = !DILocalVariable(name: "pipe_right", scope: !446, file: !3, line: 384, type: !21, align: 16)
!446 = distinct !DILexicalBlock(scope: !444, file: !3, line: 384, column: 17)
!447 = !DILocalVariable(name: "gap_top", scope: !448, file: !3, line: 385, type: !21, align: 16)
!448 = distinct !DILexicalBlock(scope: !446, file: !3, line: 385, column: 17)
!449 = !DILocalVariable(name: "gap_bottom", scope: !450, file: !3, line: 386, type: !21, align: 16)
!450 = distinct !DILexicalBlock(scope: !448, file: !3, line: 386, column: 17)
!451 = !DILocation(line: 0, scope: !438)
!452 = !DILocation(line: 0, scope: !440)
!453 = !DILocation(line: 367, column: 29, scope: !427)
!454 = !DILocation(line: 0, scope: !432)
!455 = !DILocation(line: 0, scope: !434)
!456 = !DILocation(line: 369, column: 27, scope: !434)
!457 = !DILocation(line: 0, scope: !436)
!458 = !DILocation(line: 373, column: 12, scope: !440)
!459 = !DILocation(line: 399, column: 2, scope: !427)
!460 = !DILocation(line: 0, scope: !442)
!461 = !DILocation(line: 382, column: 16, scope: !442)
!462 = !DILocation(line: 383, column: 33, scope: !442)
!463 = !DILocation(line: 0, scope: !444)
!464 = !DILocation(line: 0, scope: !446)
!465 = !DILocation(line: 0, scope: !448)
!466 = !DILocation(line: 0, scope: !450)
!467 = !DILocation(line: 388, column: 20, scope: !450)
!468 = !DILocation(line: 385, column: 31, scope: !446)
!469 = !DILocation(line: 386, column: 34, scope: !448)
!470 = !DILocation(line: 389, column: 24, scope: !450)
!471 = !DILocation(line: 381, column: 15, scope: !442)
!472 = distinct !DISubprogram(name: "drawReadyScreen", linkageName: "_ZN3lib15drawReadyScreen17h28203f98bd85755bE", scope: !2, file: !3, line: 579, type: !306, scopeLine: 579, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !473)
!473 = !{!474}
!474 = !DILocalVariable(name: "bird_y", scope: !475, file: !3, line: 580, type: !21, align: 16)
!475 = distinct !DILexicalBlock(scope: !472, file: !3, line: 580, column: 5)
!476 = !DILocation(line: 0, scope: !475)
!477 = !DILocation(line: 582, column: 5, scope: !475)
!478 = !DILocation(line: 585, column: 5, scope: !475)
!479 = !DILocation(line: 586, column: 5, scope: !475)
!480 = !DILocation(line: 587, column: 5, scope: !475)
!481 = !DILocation(line: 588, column: 5, scope: !475)
!482 = !DILocation(line: 589, column: 2, scope: !472)
!483 = distinct !DISubprogram(name: "spawn_initial_pipes", linkageName: "_ZN3lib19spawn_initial_pipes17h2e23eac7186d6fd2E", scope: !2, file: !3, line: 308, type: !306, scopeLine: 308, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23)
!484 = !DILocation(line: 309, column: 5, scope: !483)
!485 = !DILocation(line: 310, column: 2, scope: !483)
!486 = distinct !DISubprogram(name: "find_rightmost_pipe_x", linkageName: "_ZN3lib21find_rightmost_pipe_x17hadc4e3130a184b0aE", scope: !2, file: !3, line: 276, type: !383, scopeLine: 276, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !487)
!487 = !{!488, !490}
!488 = !DILocalVariable(name: "max_x", scope: !489, file: !3, line: 278, type: !21, align: 16)
!489 = distinct !DILexicalBlock(scope: !486, file: !3, line: 278, column: 9)
!490 = !DILocalVariable(name: "i", scope: !491, file: !3, line: 279, type: !93, align: 32)
!491 = distinct !DILexicalBlock(scope: !489, file: !3, line: 279, column: 9)
!492 = !DILocation(line: 0, scope: !489)
!493 = !DILocation(line: 0, scope: !491)
!494 = !DILocation(line: 281, column: 16, scope: !491)
!495 = !DILocation(line: 288, column: 2, scope: !486)
!496 = distinct !DISubprogram(name: "clearFB", linkageName: "_ZN3lib7clearFB17hdd3e5919c5b634efE", scope: !2, file: !3, line: 135, type: !306, scopeLine: 135, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !497)
!497 = !{!498}
!498 = !DILocalVariable(name: "i", scope: !499, file: !3, line: 136, type: !93, align: 32)
!499 = distinct !DILexicalBlock(scope: !496, file: !3, line: 136, column: 5)
!500 = !DILocation(line: 0, scope: !499)
!501 = !DILocation(line: 138, column: 9, scope: !499)
!502 = !DILocation(line: 141, column: 2, scope: !496)
!503 = distinct !DISubprogram(name: "drawBird", linkageName: "_ZN3lib8drawBird17hf8f2a7b43ff767a3E", scope: !2, file: !3, line: 533, type: !306, scopeLine: 533, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !504)
!504 = !{!505, !507}
!505 = !DILocalVariable(name: "x", scope: !506, file: !3, line: 535, type: !21, align: 16)
!506 = distinct !DILexicalBlock(scope: !503, file: !3, line: 535, column: 9)
!507 = !DILocalVariable(name: "y", scope: !508, file: !3, line: 536, type: !21, align: 16)
!508 = distinct !DILexicalBlock(scope: !506, file: !3, line: 536, column: 9)
!509 = !DILocation(line: 0, scope: !506)
!510 = !DILocation(line: 536, column: 17, scope: !506)
!511 = !DILocation(line: 0, scope: !508)
!512 = !DILocation(line: 537, column: 44, scope: !508)
!513 = !DILocation(line: 537, column: 9, scope: !508)
!514 = !DILocation(line: 539, column: 2, scope: !503)
!515 = distinct !DISubprogram(name: "drawPipe", linkageName: "_ZN3lib8drawPipe17hb26dbc7dfdbd4978E", scope: !2, file: !3, line: 542, type: !516, scopeLine: 542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !518)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !93}
!518 = !{!519, !520, !522, !524, !526}
!519 = !DILocalVariable(name: "idx", arg: 1, scope: !515, file: !3, line: 542, type: !93)
!520 = !DILocalVariable(name: "x", scope: !521, file: !3, line: 544, type: !21, align: 16)
!521 = distinct !DILexicalBlock(scope: !515, file: !3, line: 544, column: 9)
!522 = !DILocalVariable(name: "gap_y", scope: !523, file: !3, line: 545, type: !21, align: 16)
!523 = distinct !DILexicalBlock(scope: !521, file: !3, line: 545, column: 9)
!524 = !DILocalVariable(name: "gap_top", scope: !525, file: !3, line: 546, type: !21, align: 16)
!525 = distinct !DILexicalBlock(scope: !523, file: !3, line: 546, column: 9)
!526 = !DILocalVariable(name: "gap_bottom", scope: !527, file: !3, line: 547, type: !21, align: 16)
!527 = distinct !DILexicalBlock(scope: !525, file: !3, line: 547, column: 9)
!528 = !DILocation(line: 0, scope: !515)
!529 = !DILocation(line: 544, column: 17, scope: !515)
!530 = !DILocation(line: 0, scope: !521)
!531 = !DILocation(line: 545, column: 21, scope: !521)
!532 = !DILocation(line: 0, scope: !523)
!533 = !DILocation(line: 546, column: 23, scope: !523)
!534 = !DILocation(line: 0, scope: !525)
!535 = !DILocation(line: 547, column: 26, scope: !525)
!536 = !DILocation(line: 0, scope: !527)
!537 = !DILocation(line: 549, column: 12, scope: !527)
!538 = !DILocation(line: 552, column: 12, scope: !527)
!539 = !DILocation(line: 550, column: 28, scope: !527)
!540 = !DILocation(line: 550, column: 48, scope: !527)
!541 = !DILocation(line: 550, column: 13, scope: !527)
!542 = !DILocation(line: 549, column: 9, scope: !527)
!543 = !DILocation(line: 556, column: 2, scope: !515)
!544 = !DILocation(line: 553, column: 37, scope: !527)
!545 = !DILocation(line: 553, column: 13, scope: !527)
!546 = !DILocation(line: 552, column: 9, scope: !527)
!547 = distinct !DISubprogram(name: "drawRect", linkageName: "_ZN3lib8drawRect17h579d1c66bf16d8b0E", scope: !2, file: !3, line: 224, type: !548, scopeLine: 224, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !550)
!548 = !DISubroutineType(cc: DW_CC_nocall, types: !549)
!549 = !{null, !21, !21, !21, !21, !5}
!550 = !{!551, !552, !553, !554, !555}
!551 = !DILocalVariable(name: "x0", arg: 1, scope: !547, file: !3, line: 224, type: !21)
!552 = !DILocalVariable(name: "y0", arg: 2, scope: !547, file: !3, line: 224, type: !21)
!553 = !DILocalVariable(name: "x1", arg: 3, scope: !547, file: !3, line: 224, type: !21)
!554 = !DILocalVariable(name: "y1", arg: 4, scope: !547, file: !3, line: 224, type: !21)
!555 = !DILocalVariable(name: "color", arg: 5, scope: !547, file: !3, line: 224, type: !5)
!556 = !DILocation(line: 0, scope: !547)
!557 = !DILocation(line: 225, column: 5, scope: !547)
!558 = !DILocation(line: 226, column: 5, scope: !547)
!559 = !DILocation(line: 227, column: 5, scope: !547)
!560 = !DILocation(line: 228, column: 5, scope: !547)
!561 = !DILocation(line: 229, column: 2, scope: !547)
!562 = distinct !DISubprogram(name: "fillRect", linkageName: "_ZN3lib8fillRect17h4f9b61cc7fa27dcbE", scope: !2, file: !3, line: 160, type: !548, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !563)
!563 = !{!564, !565, !566, !567, !568, !569, !571, !573, !575, !577, !579, !581, !583, !585, !587, !589, !591, !593, !595, !597, !599}
!564 = !DILocalVariable(name: "x0", arg: 1, scope: !562, file: !3, line: 160, type: !21)
!565 = !DILocalVariable(name: "y0", arg: 2, scope: !562, file: !3, line: 160, type: !21)
!566 = !DILocalVariable(name: "x1", arg: 3, scope: !562, file: !3, line: 160, type: !21)
!567 = !DILocalVariable(name: "y1", arg: 4, scope: !562, file: !3, line: 160, type: !21)
!568 = !DILocalVariable(name: "color", arg: 5, scope: !562, file: !3, line: 160, type: !5)
!569 = !DILocalVariable(name: "x0", scope: !570, file: !3, line: 162, type: !21, align: 16)
!570 = distinct !DILexicalBlock(scope: !562, file: !3, line: 162, column: 5)
!571 = !DILocalVariable(name: "y0", scope: !572, file: !3, line: 163, type: !21, align: 16)
!572 = distinct !DILexicalBlock(scope: !570, file: !3, line: 163, column: 5)
!573 = !DILocalVariable(name: "x1", scope: !574, file: !3, line: 164, type: !21, align: 16)
!574 = distinct !DILexicalBlock(scope: !572, file: !3, line: 164, column: 5)
!575 = !DILocalVariable(name: "y1", scope: !576, file: !3, line: 165, type: !21, align: 16)
!576 = distinct !DILexicalBlock(scope: !574, file: !3, line: 165, column: 5)
!577 = !DILocalVariable(name: "start_byte", scope: !578, file: !3, line: 176, type: !93, align: 32)
!578 = distinct !DILexicalBlock(scope: !576, file: !3, line: 176, column: 5)
!579 = !DILocalVariable(name: "end_byte", scope: !580, file: !3, line: 177, type: !93, align: 32)
!580 = distinct !DILexicalBlock(scope: !578, file: !3, line: 177, column: 5)
!581 = !DILocalVariable(name: "start_mask", scope: !582, file: !3, line: 178, type: !5, align: 8)
!582 = distinct !DILexicalBlock(scope: !580, file: !3, line: 178, column: 5)
!583 = !DILocalVariable(name: "end_mask", scope: !584, file: !3, line: 179, type: !5, align: 8)
!584 = distinct !DILexicalBlock(scope: !582, file: !3, line: 179, column: 5)
!585 = !DILocalVariable(name: "y", scope: !586, file: !3, line: 181, type: !21, align: 16)
!586 = distinct !DILexicalBlock(scope: !584, file: !3, line: 181, column: 5)
!587 = !DILocalVariable(name: "row_base", scope: !588, file: !3, line: 183, type: !93, align: 32)
!588 = distinct !DILexicalBlock(scope: !586, file: !3, line: 183, column: 9)
!589 = !DILocalVariable(name: "mask", scope: !590, file: !3, line: 186, type: !5, align: 8)
!590 = distinct !DILexicalBlock(scope: !588, file: !3, line: 186, column: 13)
!591 = !DILocalVariable(name: "idx", scope: !592, file: !3, line: 187, type: !93, align: 32)
!592 = distinct !DILexicalBlock(scope: !590, file: !3, line: 187, column: 13)
!593 = !DILocalVariable(name: "idx_start", scope: !594, file: !3, line: 195, type: !93, align: 32)
!594 = distinct !DILexicalBlock(scope: !588, file: !3, line: 195, column: 13)
!595 = !DILocalVariable(name: "fill_byte", scope: !596, file: !3, line: 203, type: !5, align: 8)
!596 = distinct !DILexicalBlock(scope: !594, file: !3, line: 203, column: 13)
!597 = !DILocalVariable(name: "b", scope: !598, file: !3, line: 204, type: !93, align: 32)
!598 = distinct !DILexicalBlock(scope: !596, file: !3, line: 204, column: 13)
!599 = !DILocalVariable(name: "idx_end", scope: !600, file: !3, line: 211, type: !93, align: 32)
!600 = distinct !DILexicalBlock(scope: !598, file: !3, line: 211, column: 13)
!601 = !DILocation(line: 0, scope: !562)
!602 = !DILocation(line: 0, scope: !570)
!603 = !DILocation(line: 0, scope: !572)
!604 = !DILocation(line: 0, scope: !574)
!605 = !DILocation(line: 0, scope: !576)
!606 = !DILocation(line: 167, column: 8, scope: !576)
!607 = !DILocation(line: 171, column: 8, scope: !576)
!608 = !DILocation(line: 172, column: 8, scope: !576)
!609 = !DILocation(line: 173, column: 8, scope: !576)
!610 = !DILocation(line: 174, column: 8, scope: !576)
!611 = !DILocation(line: 176, column: 22, scope: !576)
!612 = !DILocation(line: 0, scope: !578)
!613 = !DILocation(line: 177, column: 20, scope: !578)
!614 = !DILocation(line: 0, scope: !580)
!615 = !DILocation(line: 178, column: 39, scope: !580)
!616 = !DILocation(line: 178, column: 28, scope: !580)
!617 = !DILocation(line: 0, scope: !582)
!618 = !DILocation(line: 179, column: 37, scope: !582)
!619 = !DILocation(line: 179, column: 26, scope: !582)
!620 = !DILocation(line: 0, scope: !584)
!621 = !DILocation(line: 0, scope: !586)
!622 = !DILocation(line: 182, column: 5, scope: !586)
!623 = !DILocation(line: 182, column: 11, scope: !586)
!624 = !DILocation(line: 183, column: 24, scope: !586)
!625 = !DILocation(line: 0, scope: !588)
!626 = !DILocation(line: 185, column: 12, scope: !588)
!627 = !DILocation(line: 221, column: 2, scope: !562)
!628 = !DILocation(line: 0, scope: !594)
!629 = !DILocalVariable(name: "self", arg: 1, scope: !630, file: !631, line: 682, type: !637)
!630 = distinct !DISubprogram(name: "get_unchecked_mut<i8, usize>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$17get_unchecked_mut17h4cafa0213b7c8b52E", scope: !632, file: !631, line: 682, type: !634, scopeLine: 682, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !644, retainedNodes: !642)
!631 = !DIFile(filename: "/rustlib/src/rust/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "3a151d8ad3401591df12e651dca32afb")
!632 = !DINamespace(name: "{impl#0}", scope: !633)
!633 = !DINamespace(name: "slice", scope: !59)
!634 = !DISubroutineType(types: !635)
!635 = !{!636, !637, !93, !218}
!636 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut i8", baseType: !5, size: 32, align: 32, dwarfAddressSpace: 0)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [i8]", file: !18, size: 64, align: 32, elements: !638, templateParams: !23, identifier: "ada2f5e14ad166ff25ebe72e9356385f")
!638 = !{!639, !641}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !637, file: !18, baseType: !640, size: 32, align: 32)
!640 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 32, align: 32, dwarfAddressSpace: 0)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !637, file: !18, baseType: !93, size: 32, align: 32, offset: 32)
!642 = !{!629, !643}
!643 = !DILocalVariable(name: "index", arg: 2, scope: !630, file: !631, line: 682, type: !93)
!644 = !{!645, !646}
!645 = !DITemplateTypeParameter(name: "T", type: !5)
!646 = !DITemplateTypeParameter(name: "I", type: !93)
!647 = !DILocation(line: 0, scope: !630, inlinedAt: !648)
!648 = distinct !DILocation(line: 197, column: 30, scope: !594)
!649 = !DILocalVariable(name: "self", arg: 1, scope: !650, file: !651, line: 254, type: !93)
!650 = distinct !DISubprogram(name: "get_unchecked_mut<i8>", linkageName: "_ZN75_$LT$usize$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$17get_unchecked_mut17h96bc0c6ea2bafeceE", scope: !652, file: !651, line: 254, type: !654, scopeLine: 254, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !663, retainedNodes: !661)
!651 = !DIFile(filename: "/rustlib/src/rust/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "1a82fa3b7b71e0e3e5ba9928c742ba5b")
!652 = !DINamespace(name: "{impl#2}", scope: !653)
!653 = !DINamespace(name: "index", scope: !633)
!654 = !DISubroutineType(types: !655)
!655 = !{!656, !93, !657, !218}
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i8", baseType: !5, size: 32, align: 32, dwarfAddressSpace: 0)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "*mut [i8]", file: !18, size: 64, align: 32, elements: !658, templateParams: !23, identifier: "8765094cbca83adceff7d19f7e339034")
!658 = !{!659, !660}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !657, file: !18, baseType: !640, size: 32, align: 32)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !657, file: !18, baseType: !93, size: 32, align: 32, offset: 32)
!661 = !{!649, !662}
!662 = !DILocalVariable(name: "slice", arg: 2, scope: !650, file: !651, line: 254, type: !657)
!663 = !{!645}
!664 = !DILocation(line: 0, scope: !650, inlinedAt: !665)
!665 = distinct !DILocation(line: 689, column: 30, scope: !630, inlinedAt: !648)
!666 = !DILocation(line: 261, column: 18, scope: !650, inlinedAt: !665)
!667 = !DILocation(line: 197, column: 17, scope: !594)
!668 = !DILocation(line: 0, scope: !596)
!669 = !DILocation(line: 0, scope: !598)
!670 = !DILocation(line: 205, column: 19, scope: !598)
!671 = !DILocation(line: 206, column: 17, scope: !598)
!672 = !DILocation(line: 0, scope: !630, inlinedAt: !673)
!673 = distinct !DILocation(line: 206, column: 30, scope: !598)
!674 = !DILocation(line: 0, scope: !650, inlinedAt: !675)
!675 = distinct !DILocation(line: 689, column: 30, scope: !630, inlinedAt: !673)
!676 = !DILocation(line: 261, column: 18, scope: !650, inlinedAt: !677)
!677 = distinct !DILocation(line: 689, column: 30, scope: !630, inlinedAt: !678)
!678 = distinct !DILocation(line: 213, column: 30, scope: !600)
!679 = !DILocation(line: 261, column: 18, scope: !650, inlinedAt: !680)
!680 = !DILocation(line: 689, column: 30, scope: !630, inlinedAt: !625)
!681 = !DILocation(line: 219, column: 9, scope: !588)
!682 = distinct !DISubprogram(name: "setPixel", linkageName: "_ZN3lib8setPixel17h43bda99ce5e3fe75E", scope: !2, file: !3, line: 144, type: !683, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !685)
!683 = !DISubroutineType(cc: DW_CC_nocall, types: !684)
!684 = !{null, !21, !21, !5}
!685 = !{!686, !687, !688, !689, !691}
!686 = !DILocalVariable(name: "x", arg: 1, scope: !682, file: !3, line: 144, type: !21)
!687 = !DILocalVariable(name: "y", arg: 2, scope: !682, file: !3, line: 144, type: !21)
!688 = !DILocalVariable(name: "color", arg: 3, scope: !682, file: !3, line: 144, type: !5)
!689 = !DILocalVariable(name: "byte_idx", scope: !690, file: !3, line: 149, type: !93, align: 32)
!690 = distinct !DILexicalBlock(scope: !682, file: !3, line: 149, column: 5)
!691 = !DILocalVariable(name: "mask", scope: !692, file: !3, line: 150, type: !5, align: 8)
!692 = distinct !DILexicalBlock(scope: !690, file: !3, line: 150, column: 5)
!693 = !DILocation(line: 0, scope: !682)
!694 = !DILocation(line: 0, scope: !690)
!695 = !DILocation(line: 0, scope: !692)
!696 = !DILocation(line: 150, column: 33, scope: !690)
!697 = !DILocation(line: 150, column: 22, scope: !690)
!698 = !DILocation(line: 149, column: 21, scope: !682)
!699 = !DILocation(line: 149, column: 32, scope: !682)
!700 = !DILocation(line: 149, column: 20, scope: !682)
!701 = !DILocation(line: 0, scope: !630, inlinedAt: !702)
!702 = distinct !DILocation(line: 153, column: 22, scope: !692)
!703 = !DILocation(line: 0, scope: !650, inlinedAt: !704)
!704 = distinct !DILocation(line: 689, column: 30, scope: !630, inlinedAt: !702)
!705 = !DILocation(line: 261, column: 18, scope: !650, inlinedAt: !704)
!706 = !DILocation(line: 153, column: 9, scope: !692)
!707 = !DILocation(line: 157, column: 2, scope: !682)
!708 = distinct !DISubprogram(name: "drawDigit", linkageName: "_ZN3lib9drawDigit17h0ebc745f1e2cb6a0E", scope: !2, file: !3, line: 438, type: !246, scopeLine: 438, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !709)
!709 = !{!710, !711, !712, !713, !714, !716, !718, !720, !722, !724, !726, !728, !730}
!710 = !DILocalVariable(name: "x", arg: 1, scope: !708, file: !3, line: 438, type: !21)
!711 = !DILocalVariable(name: "y", arg: 2, scope: !708, file: !3, line: 438, type: !21)
!712 = !DILocalVariable(name: "digit", arg: 3, scope: !708, file: !3, line: 438, type: !21)
!713 = !DILocalVariable(name: "color", arg: 4, scope: !708, file: !3, line: 438, type: !5)
!714 = !DILocalVariable(name: "x_bit", scope: !715, file: !3, line: 446, type: !60, align: 8)
!715 = distinct !DILexicalBlock(scope: !708, file: !3, line: 446, column: 5)
!716 = !DILocalVariable(name: "row", scope: !717, file: !3, line: 448, type: !21, align: 16)
!717 = distinct !DILexicalBlock(scope: !715, file: !3, line: 448, column: 5)
!718 = !DILocalVariable(name: "font_row", scope: !719, file: !3, line: 450, type: !5, align: 8)
!719 = distinct !DILexicalBlock(scope: !717, file: !3, line: 450, column: 9)
!720 = !DILocalVariable(name: "byte_idx", scope: !721, file: !3, line: 451, type: !93, align: 32)
!721 = distinct !DILexicalBlock(scope: !719, file: !3, line: 451, column: 9)
!722 = !DILocalVariable(name: "shift", scope: !723, file: !3, line: 455, type: !60, align: 8)
!723 = distinct !DILexicalBlock(scope: !721, file: !3, line: 455, column: 13)
!724 = !DILocalVariable(name: "mask1", scope: !725, file: !3, line: 456, type: !5, align: 8)
!725 = distinct !DILexicalBlock(scope: !723, file: !3, line: 456, column: 13)
!726 = !DILocalVariable(name: "shift", scope: !727, file: !3, line: 464, type: !60, align: 8)
!727 = distinct !DILexicalBlock(scope: !721, file: !3, line: 464, column: 13)
!728 = !DILocalVariable(name: "mask1", scope: !729, file: !3, line: 465, type: !5, align: 8)
!729 = distinct !DILexicalBlock(scope: !727, file: !3, line: 465, column: 13)
!730 = !DILocalVariable(name: "mask2", scope: !731, file: !3, line: 466, type: !5, align: 8)
!731 = distinct !DILexicalBlock(scope: !729, file: !3, line: 466, column: 13)
!732 = !DILocation(line: 0, scope: !708)
!733 = !DILocation(line: 439, column: 8, scope: !708)
!734 = !DILocation(line: 446, column: 17, scope: !708)
!735 = !DILocation(line: 0, scope: !715)
!736 = !DILocation(line: 0, scope: !717)
!737 = !DILocation(line: 449, column: 11, scope: !717)
!738 = !DILocalVariable(name: "self", arg: 1, scope: !739, file: !631, line: 637, type: !743)
!739 = distinct !DISubprogram(name: "get_unchecked<i8, usize>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$13get_unchecked17h823336c082fef02cE", scope: !632, file: !631, line: 637, type: !740, scopeLine: 637, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !644, retainedNodes: !747)
!740 = !DISubroutineType(types: !741)
!741 = !{!742, !743, !93, !218}
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i8", baseType: !5, size: 32, align: 32, dwarfAddressSpace: 0)
!743 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i8]", file: !18, size: 64, align: 32, elements: !744, templateParams: !23, identifier: "323dc304adbca782d453d94ce0d24f97")
!744 = !{!745, !746}
!745 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !743, file: !18, baseType: !640, size: 32, align: 32)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !743, file: !18, baseType: !93, size: 32, align: 32, offset: 32)
!747 = !{!738, !748}
!748 = !DILocalVariable(name: "index", arg: 2, scope: !739, file: !631, line: 637, type: !93)
!749 = !DILocation(line: 0, scope: !739, inlinedAt: !750)
!750 = distinct !DILocation(line: 450, column: 36, scope: !717)
!751 = !DILocalVariable(name: "self", arg: 1, scope: !752, file: !651, line: 234, type: !93)
!752 = distinct !DISubprogram(name: "get_unchecked<i8>", linkageName: "_ZN75_$LT$usize$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$13get_unchecked17h4855f446705aafb2E", scope: !652, file: !651, line: 234, type: !753, scopeLine: 234, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !663, retainedNodes: !760)
!753 = !DISubroutineType(types: !754)
!754 = !{!755, !93, !756, !218}
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !5, size: 32, align: 32, dwarfAddressSpace: 0)
!756 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [i8]", file: !18, size: 64, align: 32, elements: !757, templateParams: !23, identifier: "fa066b6ee6cdd9ae6154fbc57a99506a")
!757 = !{!758, !759}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !756, file: !18, baseType: !640, size: 32, align: 32)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !756, file: !18, baseType: !93, size: 32, align: 32, offset: 32)
!760 = !{!751, !761}
!761 = !DILocalVariable(name: "slice", arg: 2, scope: !752, file: !651, line: 234, type: !756)
!762 = !DILocation(line: 0, scope: !752, inlinedAt: !763)
!763 = distinct !DILocation(line: 644, column: 26, scope: !739, inlinedAt: !750)
!764 = !DILocation(line: 248, column: 13, scope: !752, inlinedAt: !763)
!765 = !DILocation(line: 450, column: 24, scope: !717)
!766 = !DILocation(line: 0, scope: !719)
!767 = !DILocation(line: 451, column: 25, scope: !719)
!768 = !DILocation(line: 451, column: 24, scope: !719)
!769 = !DILocation(line: 0, scope: !721)
!770 = !DILocation(line: 453, column: 12, scope: !721)
!771 = !DILocation(line: 261, column: 18, scope: !650, inlinedAt: !772)
!772 = !DILocation(line: 689, column: 30, scope: !630, inlinedAt: !769)
!773 = !DILocation(line: 478, column: 2, scope: !708)
!774 = !DILocation(line: 0, scope: !727)
!775 = !DILocation(line: 0, scope: !729)
!776 = !DILocation(line: 0, scope: !731)
!777 = !DILocation(line: 465, column: 25, scope: !727)
!778 = !DILocation(line: 0, scope: !630, inlinedAt: !779)
!779 = distinct !DILocation(line: 468, column: 30, scope: !731)
!780 = !DILocation(line: 0, scope: !650, inlinedAt: !781)
!781 = distinct !DILocation(line: 689, column: 30, scope: !630, inlinedAt: !779)
!782 = !DILocation(line: 261, column: 18, scope: !650, inlinedAt: !781)
!783 = !DILocation(line: 468, column: 17, scope: !731)
!784 = !DILocation(line: 0, scope: !630, inlinedAt: !785)
!785 = distinct !DILocation(line: 469, column: 30, scope: !731)
!786 = !DILocation(line: 0, scope: !650, inlinedAt: !787)
!787 = distinct !DILocation(line: 689, column: 30, scope: !630, inlinedAt: !785)
!788 = !DILocation(line: 467, column: 13, scope: !731)
!789 = distinct !DISubprogram(name: "drawPipes", linkageName: "_ZN3lib9drawPipes17hc093196a1ee1552cE", scope: !2, file: !3, line: 559, type: !306, scopeLine: 559, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !790)
!790 = !{!791}
!791 = !DILocalVariable(name: "i", scope: !792, file: !3, line: 561, type: !93, align: 32)
!792 = distinct !DILexicalBlock(scope: !789, file: !3, line: 561, column: 9)
!793 = !DILocation(line: 0, scope: !792)
!794 = !DILocation(line: 563, column: 16, scope: !792)
!795 = !DILocation(line: 564, column: 17, scope: !792)
!796 = !DILocation(line: 563, column: 13, scope: !792)
!797 = !DILocation(line: 569, column: 2, scope: !789)
!798 = distinct !DISubprogram(name: "drawScore", linkageName: "_ZN3lib9drawScore17h21f5311f5325b862E", scope: !2, file: !3, line: 572, type: !306, scopeLine: 572, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23)
!799 = !DILocation(line: 574, column: 41, scope: !798)
!800 = !DILocation(line: 574, column: 9, scope: !798)
!801 = !DILocation(line: 576, column: 2, scope: !798)
!802 = distinct !DISubprogram(name: "game_tick", linkageName: "_ZN3lib9game_tick17h3339f306e2fb44f3E", scope: !2, file: !3, line: 402, type: !349, scopeLine: 402, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !54, templateParams: !23, retainedNodes: !803)
!803 = !{!804}
!804 = !DILocalVariable(name: "flap_input", arg: 1, scope: !802, file: !3, line: 402, type: !5)
!805 = !DILocation(line: 0, scope: !802)
!806 = !DILocation(line: 404, column: 12, scope: !802)
!807 = !DILocation(line: 405, column: 16, scope: !802)
!808 = !DILocation(line: 425, column: 12, scope: !802)
!809 = !DILocation(line: 414, column: 13, scope: !802)
!810 = !DILocation(line: 415, column: 13, scope: !802)
!811 = !DILocation(line: 417, column: 16, scope: !802)
!812 = !DILocation(line: 427, column: 17, scope: !802)
!813 = !DILocation(line: 431, column: 2, scope: !802)
!814 = !DILocation(line: 418, column: 17, scope: !802)
